////////////////////////////////////////////////////////////////////////////////
//
/**
\file
\brief Реализация класса Figure
*/
//
////////////////////////////////////////////////////////////////////////////////

#include "Figure.h"
#include "../Utils/Last.h"

namespace model
{
  //------------------------------------------------------------------------------
  /**
     Метод получения примитивов фигуры
  */
  //--- 
  PrimitiveContainer Figure::GetPrimitives() const
  {
    return m_primitives;
  }

  //------------------------------------------------------------------------------
  /**
     Установить id фигуры
     \param id идентификатор фигуры
  */
  //--- 
  void Figure::SetId(IdType id)
  {
    m_id = id;
  }

  //------------------------------------------------------------------------------
  /**
     Получить id фигуры
     \return идентификатор фигуры
  */
  //--- 
  IdType Figure::GetId() const
  {
    return m_id;
  }

} // namespace model