////////////////////////////////////////////////////////////////////////////////
//
/**
\file
\brief Реализация класса точки Point
*/
//
////////////////////////////////////////////////////////////////////////////////

#include "Point.h"
#include "../Utils/Last.h"

namespace model
{

  //------------------------------------------------------------------------------
  /**
     Получение типа фигуры
  */
  //--- 
  FigureType Point::GetType() const
  {
    return FigureType::Point;
  }

  //------------------------------------------------------------------------------
  /**
     Метод, дающий ответ о том, готова ли фигура к построению
     \return готова ли фигура к построению
  */
  //--- 
  bool Point::IsReady() const
  {
    return true;
  }

  //------------------------------------------------------------------------------
  /**
     Добавление геометрической точки в фигуру
     \param point геометрическая точка, добавляемая в фигуру
  */
  //--- 
  void Point::AddPoint(const geometry::Point& point)
  {
    m_primitives = { std::make_unique<geometry::Point>(point) };
  }

  //------------------------------------------------------------------------------
  /**
     Создать копию точки
  */
  //--- 
  FigureUPtr Point::Duplicate() const
  {
    return std::make_unique<Point>(*this);
  }

  //------------------------------------------------------------------------------
  /**
    Изменить последнюю точку
  */
  //--- 
  void Point::ChangeLastPoint(const geometry::Point& point)
  {
    m_primitives = { std::make_unique<geometry::Point>(point) };
  }

} // namespace model