////////////////////////////////////////////////////////////////////////////////
//
/**
  \file
  \brief Реализация класса отрезка примитивов
*/
//
////////////////////////////////////////////////////////////////////////////////


#include "GeometryCircle.h"
#include "../Utils/Last.h"

namespace geometry
{
  //------------------------------------------------------------------------------
  /**
     Конструктор
     \param begPoint начальная точка отрезка
     \param endPoint конечная точка отрезка
  */
  //--- 
  Circle::Circle(const Point& m_center, const Point& m_onCircle)
    : m_center(m_center)
    , m_onCircle(m_onCircle)
  {
  }

  //------------------------------------------------------------------------------
  /**
     Метод, возвращающий тип примитива
  */
  //--- 
  PrimitiveType Circle::GetType() const
  {
    return PrimitiveType::Circle;
  }

  //------------------------------------------------------------------------------
  /**
    Метод получения начальной точки отрезка
  */
  //--- 
  const Point& Circle::GetCenter() const
  {
    return m_center;
  }

  //------------------------------------------------------------------------------
  /**
     Метод получения конечной точки отрезка
  */
  //--- 
  const Point& Circle::GetOnCircle() const
  {
    return m_onCircle;
  }

} // namespace geometry