////////////////////////////////////////////////////////////////////////////////
//
/**
  \file
  \brief Объявление класса точки примитивов
*/
//
////////////////////////////////////////////////////////////////////////////////

#pragma once

#include "Primitive.h"

namespace geometry
{
  ////////////////////////////////////////////////////////////////////////////////
  //
  /// Объявление класса точки примитивов
  /**
  */
  ////////////////////////////////////////////////////////////////////////////////
  class Point : public IPrimitive
  {
  private:
    double m_x;  /// < координата геометрической точки по оси абсцисс
    double m_y;  /// < координата геометрической точки по оси ординат
  public:
    /// Конструктор
    Point(double x = 0.0, double y = 0.0);
    /// Метод, возвращающий тип примитива
    virtual PrimitiveType GetType() const override;
    /// Метод получения точки по оси абсцисс
    double GetX() const;
    /// Метод получения точки по оси ординат
    double GetY() const;
  };
}