////////////////////////////////////////////////////////////////////////////////
//
/**
  \file
  \brief Реализация класса точки примитивов
*/
//
////////////////////////////////////////////////////////////////////////////////


#include "GeometryPoint.h"
#include "../Utils/Last.h"

namespace geometry
{
  //------------------------------------------------------------------------------
  /**
     Конструктор
     \param x координата геометрической точки по оси абсцисс
     \param y координата геометрической точки по оси ординат
  */
  //--- 
  Point::Point(double x, double y)
    : m_x(x)
    , m_y(y)
  {
  }

  //------------------------------------------------------------------------------
  /**
     Метод, возвращающий тип примитива
  */
  //--- 
  PrimitiveType Point::GetType() const
  {
    return PrimitiveType::Point;
  }

  //------------------------------------------------------------------------------
  /**
     Метод получения m_x
  */
  //--- 
  double Point::GetX() const
  {
    return m_x;
  }

  //------------------------------------------------------------------------------
  /**
     Метод получения m_y
  */
  //--- 
  double Point::GetY() const
  {
    return m_y;
  }

} // namespace geometry